Model: "model"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 input_1 (InputLayer)        [(None, 66, 200, 3)]      0         
                                                                 
 normalization (Normalizati  (None, 66, 200, 3)        7         
 on)                                                             
                                                                 
 conv2d (Conv2D)             (None, 31, 98, 24)        1824      
                                                                 
 dropout (Dropout)           (None, 31, 98, 24)        0         
                                                                 
 conv2d_1 (Conv2D)           (None, 14, 47, 36)        21636     
                                                                 
 conv2d_2 (Conv2D)           (None, 5, 22, 48)         43248     
                                                                 
 conv2d_3 (Conv2D)           (None, 3, 20, 64)         27712     
                                                                 
 dropout_1 (Dropout)         (None, 3, 20, 64)         0         
                                                                 
 conv2d_4 (Conv2D)           (None, 1, 18, 64)         36928     
                                                                 
 flatten (Flatten)           (None, 1152)              0         
                                                                 
 dense (Dense)               (None, 100)               115300    
                                                                 
 dense_1 (Dense)             (None, 50)                5050      
                                                                 
 dropout_2 (Dropout)         (None, 50)                0         
                                                                 
 dense_2 (Dense)             (None, 20)                1020      
                                                                 
 dense_3 (Dense)             (None, 11)                231       
                                                                 
=================================================================
Total params: 252956 (988.11 KB)
Trainable params: 252949 (988.08 KB)
Non-trainable params: 7 (32.00 Byte)
_________________________________________________________________
Epochs: 25
Batchsize: 64

Data Sets Used: ['/home/luca/raspicar/data/29-04-2024_15-16-45', '/home/luca/raspicar/data/29-04-2024_15-19-54', '/home/luca/raspicar/data/29-04-2024_15-22-37', '/home/luca/raspicar/data/29-04-2024_15-18-25', '/home/luca/raspicar/data/29-04-2024_15-21-09', '/home/luca/raspicar/data/29-04-2024_15-23-31', '/home/luca/raspicar/data/29-04-2024_15-33-14', '/home/luca/raspicar/data/29-04-2024_15-33-54', '/home/luca/raspicar/data/29-04-2024_15-34-44', '/home/luca/raspicar/data/29-04-2024_15-35-14', '/home/luca/raspicar/data/29-04-2024_15-35-48', '/home/luca/raspicar/data/29-04-2024_15-36-14', '/home/luca/raspicar/data/29-04-2024_15-36-56', '/home/luca/raspicar/data/29-04-2024_15-37-34', '/home/luca/raspicar/data/29-04-2024_15-38-15', '/home/luca/raspicar/data/29-04-2024_15-33-31', '/home/luca/raspicar/data/29-04-2024_15-34-18', '/home/luca/raspicar/data/29-04-2024_15-34-58', '/home/luca/raspicar/data/29-04-2024_15-35-36', '/home/luca/raspicar/data/29-04-2024_15-36-00', '/home/luca/raspicar/data/29-04-2024_15-36-32', '/home/luca/raspicar/data/29-04-2024_15-37-14', '/home/luca/raspicar/data/29-04-2024_15-37-49', '/home/luca/raspicar/data/29-04-2024_16-22-36', '/home/luca/raspicar/data/29-04-2024_16-23-27', '/home/luca/raspicar/data/29-04-2024_16-24-28', '/home/luca/raspicar/data/29-04-2024_16-25-28', '/home/luca/raspicar/data/29-04-2024_16-26-16', '/home/luca/raspicar/data/29-04-2024_16-27-14', '/home/luca/raspicar/data/30-04-2024_13-44-21', '/home/luca/raspicar/data/30-04-2024_13-45-32', '/home/luca/raspicar/data/30-04-2024_13-47-07', '/home/luca/raspicar/data/30-04-2024_13-48-12', '/home/luca/raspicar/data/30-04-2024_13-49-53', '/home/luca/raspicar/data/30-04-2024_13-50-31']

Classes used : [-1.0, -0.8, -0.6, -0.4, -0.2, 0, 0.2, 0.4, 0.6, 0.8, 1.0]


Distribution of Steering Angles for Complete Data
Number of Images: 7705

Distribution of Steering Angles for Training Data
Number of Images: 5547

Distribution of Steering Angles for Validation Data
Number of Images: 1387

Distribution of Steering Angles for Test Data
Number of Images: 771

Accuracy: 0.5551232166018158
1neighbour: 90,404 - 697 correctly predicted

